{
    "link": "https://bbs.nga.cn/read.php?tid=40224687",
    "title": "计科学生学习方向求助",
    "post_time": "2024-05-19 18:30",
    "uid": "61097533",
    "content": "如题,大二下发现卷学习成绩保研已经没太大希望了,而且对于学习大学的课内内容实在感到痛苦(大二下还在学量子物理,每个学期和计科无关的课程占50%以上),遂打算尽力自学,争取本科就业",
    "replies": [
        {
            "mid": "37449036",
            "mtime": "2024-05-19 19:52",
            "mcontent": "现在的行情......既然你在学量子力学那PDE之类的东西应该都学过，可以考虑转AI"
        },
        {
            "mid": "62697426",
            "mtime": "2024-05-19 20:13",
            "mcontent": "1. 你对计算机感兴趣不？2. 到目前为止，累计写过多少行代码？有5万行吗？不算系统自己生成的，纯自己手写3. 工程能力提高，要以实际写过的代码积累为基础4. java，C，PHP，perl，python，golang，rust，nodejs，每种语言都有就业机会，看你使用和理解深度了5. 你才大二，想打好内功，Haskell，Lisp选一个6. 想卷机器学习，那就准备考研"
        },
        {
            "mid": "64801244",
            "mtime": "2024-05-19 22:14",
            "mcontent": "和lz情况很相似，也是大二下华五，估计看ip也知道是哪的，学校课程和就业差距也很大。我绩点在保研圈内，但是上学期进了课题组后发现我真的不喜欢科研，也不喜欢做AI相关的工作，所以未来打算本科就业来着。cs61a我们大一上就学过一个难度80%的版本吧，做过全部大作业和90%的作业题，其实感觉对大二的学生这些都是小case不用咋学。我个人觉得科班路线和就业有点差距，我很焦虑，害怕按部就班学科班的很容易来不及。这学期在实验室打工完，准备暑假开始搞java后端(其实我感觉我已经起步晚了，个人浅薄的理解是java现在卷的要上天……所以我打算技术上尽量拼命搞，然后再借助学历争取一些机会吧……)上面是我自己的碎碎念，大概没什么参考价值。。。就是看到在华五本科这种为升学和科研狂热的地方，有同学有和我一样的想法后比较有表达欲。"
        },
        {
            "mid": "65369164",
            "mtime": "2024-05-19 23:12",
            "mcontent": "你可以在职场人生那边发个帖子，那儿人多一点(我也有同样的疑惑)"
        },
        {
            "mid": "63366654",
            "mtime": "2024-05-19 23:45",
            "mcontent": "JAVA后端岗位最多也是开发里工资比较高的，前端需求比后端少，更卷一点，cpp岗位也不算少，但里面方向很多，不同方向的技术栈完全不同，所以细分到每个方向的岗位就不多了，而且c/cpp很多都是嵌入式岗，嵌入式面试难度不高，很多都是学历厂，知名学历厂就是中兴tp，学历到位点击就送，但嵌入式都是硬件公司在招，硬件公司利润低，工资比不上互联网的JAVA后端。"
        },
        {
            "mid": "63762499",
            "mtime": "2024-05-20 00:52",
            "mcontent": "java后端看学历跟个人技术其实，你可以去试试。不过这玩意干不久，优化快的很。(虾去头去尾去虾线.jpg)不过转念一想，现在国内这互联网环境似乎就没有啥方向能干的久的除非是啥重要盈利项目的领导层"
        },
        {
            "mid": "61097533",
            "mtime": "2024-05-20 17:31",
            "mcontent": "1.我觉得我算是感兴趣的，至少学这个我能专注下来，看模电，物理之类的我看一眼就烦2.我代码量很少，由于大二上及之前精力都花在卷课内了，然而我们专业纯科研导向，学的都是理论，实际写代码的课就数据结构，算法设计还有大一的两门python，c++的入门课，而且代码量也没多少，我感觉我现在代码量都不到1w3.非常同意，我觉得我这方面实在太欠缺了，但是问题是我首先对“工程”这个概念就不足够，我现在还没有思路和知识构建一个完整的项目或者工程，这方面学校是不教的，我最需要提升的就是这个4.好的，我现在只会python和c++，不能说特别深入，语言这个东西我感觉入门很快，要深入还是要很大时间成本的，所以我还是想尽量选一个往深里学，各种语言上我还没什么偏好(不过我感觉python确实比c++写起来爽，但是我看都说python只能当脚本语言用，实际工程上不太用得上)5.请问这两个语言是对哪方面提升比较高呢？我搜了一圈好像没有提到这个的6.机器学习我稍微接触了点(跑了一些基础的代码)我感觉兴趣不是特别大，今年小学期要进实验室做相关的，我得到时候再多接触接触"
        },
        {
            "mid": "61097533",
            "mtime": "2024-05-20 17:42",
            "mcontent": "感谢回复，这个学期是真的感到很迷茫了，大一结束绩点在保研圈外一两名，过一学期后还是没变，也许再卷点确实能保研，但是学习课内的知识实在太痛苦了，我觉得我自己真的不想要做科研，不爱那些理论的东西，只想往工程去做的cs61a因为是csapp的前导课程我打算快速过一遍，课程前半段的都学过所以大概看了眼，后半段很多东西没学过的，我打算先学习下，反正学这个感觉花不了太多时间，代码上也不太难，就当锻炼代码能力了我们专业比较奇葩，金(屎)课塞的满满，一学期有1/2的课都是和cs无关的，比如数据库我们要大三下才学我周围的人也是普遍选择科研的，不如说我认识的人要么已经躺平开摆了，要么就是基本已经稳稳保研而且还在专注课内的，我没有他们这样对升学的热情，所以实在不想再把大量时间消耗在课内和学术了如果你想的话我们也可以加个vx之类的，以后可以再交流，毕竟华五环境下真没几个cs本科生想着本科就业的"
        },
        {
            "mid": "62697426",
            "mtime": "2024-05-20 18:26",
            "mcontent": "1. 计算机的知识面很广，大多都要靠自学，不感兴趣，很难坚持2. 1w不到的代码量，还需要积累，把CSAPP的几个lab做了，不要抄别人的lab答案，自己查资料做3. 先撸代码，撸够了5万行代码，自然就知道为什么A系统要那么搭，B系统要这么搭4. 有余力的话，各种语言都尝试学学，用他们写点东西，别光写helloworld，或者计算数据公式之类的5. haskell或者lisp，是FP语言，能让你从全新的角度，更深入地理解“编程”的概念，学会了，拿C++/python写代码，代码行数减少20%-30%，写代码效率提升20%-30%，基本不会出bug"
        },
        {
            "mid": "61097533",
            "mtime": "2024-05-20 19:05",
            "mcontent": "感谢解答，收获很大，谢谢老哥！"
        },
        {
            "mid": "64801244",
            "mtime": "2024-05-20 20:48",
            "mcontent": "这不是巧了吗，我们学校数据库也在大三，而且好像还不是必修的(貌似是几选几)，java也在大三还是选修，和工程相关的课程很少，一直都更重视理论推导。。。。其实也不全是这种课，体系结构操作系统我们这有挺好的课，但是一些和就业无关的事情占用我太多精力了，这两个学期都花了很多精力搞我们必搞的科研项目(对我来说真是痛苦的浪费时间，感觉自己不管是兴趣还是天分都不适合)，操作系统没时间修读jyy老师的版本了。这学期在努力挣扎，未来想走一条和大部队不同的路吧。vx我已经私您了，我们可以之后再多交流信息啥的"
        },
        {
            "mid": "62600743",
            "mtime": "2024-05-20 20:55",
            "mcontent": "就业难是难，但是对于华五的来说没那么难。我去年12月份才开始准备暑期实习，之前的基础只有大四的时候自学过java基础。一个半月跟着做了两个项目(甚至没有手把手敲)，一个月刷题，一个月背八股，然后就开始投目前已经拿到暑期实习了。相信自己，至少相信自己的学历嘛，这就帮你干掉80%的人了。然后说方向，前端不熟就不说了。1.算法，这个你没有基础的话现学应该来不及2.java，招人最多但也是学的人最多的3.c++，互联网企业其实要c++的不多，要的很多也是做底层开发，方向小众难学但是较稳定。此外还有一个好处是很多嵌入式、车厂什么的也招c++4.golang，如果只想进互联网的话，学c++不如学golang，很多中大厂都招5.数分，换方向去学统计、机器学习算法6.大数据，换方向去学spark flink那一套"
        },
        {
            "mid": "107960",
            "mtime": "2024-05-21 03:11",
            "mcontent": "仿佛看到很多年前的自己…. 同背景 化5计科 同样不喜欢大物模电给你的建议就是如果确定想本科毕业就直接社畜现在就开始刷leetcode 同时 参与开源项目 刷github 星星数和commit数流行框架和常用架构相关的框架/中台 也要多看看八股文 多摸摸 不要只看文档。 大部分懂是什么，小部分深挖。 没人指望你刚毕业的小屁孩什么都懂，但是如果你某一两个能说出点东西 还是很显眼的。 system design 常见场景也要多看看多了解。 对应每类需求的现在主流的结局方案和选型 多了解点。 不一定要做过 但要知道怎么做。 本科搞AI 学位不够基本就是进大厂码农是你最好选择"
        },
        {
            "mid": "40797527",
            "mtime": "2024-05-21 08:40",
            "mcontent": "比如前端似乎卷成狗,要求一直学习最新的东西比如后端java语言说不如狗,c++之类岗位又少,也不好找工作,总之什么方向都不行写到这发现对各种方向认识也挺浅薄的,就知道个前端后端(我个人比较倾向做开发岗)是挺浅薄的，推荐去牛客知乎看看行情，问问本科就业的学长去向"
        },
        {
            "mid": "62792683",
            "mtime": "2024-07-12 18:16",
            "mcontent": "华五不担心找不到，现在的重点是你想要做什么，喜欢什么，以及最最重要的 实 习。去BOSS直聘搜下你想要做的岗位实习的知识要求去针对性学习，然后去投吧骚年"
        },
        {
            "mid": "65855073",
            "mtime": "2024-07-12 20:58",
            "mcontent": "搞AI就卷论文卷保研。开发就是java。golang需求少，rust几乎没岗位，cpp卷难穷。java面试准备网上资料很多了，leetcode hot150刷熟。函数式编程练练思路可以，可别想着找工作。工程跟一个项目走一遍基本差不多了。此外不要去面试什么数据库内核开发，linux内核开发，编译器开发，难还穷。"
        }
    ]
}