{
    "link": "https://bbs.nga.cn/read.php?tid=39459323",
    "title": "[求助] 女同事被wifi名称恶意攻击了，有什么办法可以追查到始作俑者吗",
    "post_time": "2024-03-02 15:49",
    "uid": "60641964",
    "content": "rt，首先说明一下情况，我司能搜到的wifi列表里一直存在两个带同事Buzzy(化名)大名的wifi，最早2023年已经出现，当时wifi名称叫",
    "replies": [
        {
            "mid": "544943",
            "mtime": "2024-03-02 18:09",
            "mcontent": "从公司内网或路由器log就能查出曾连接到或操作这路由器的所有设备的(内网ip和)mac地址，由此有了筛出可疑设备的条件。但这需要对很多私人和公司设备进行检查，并且若对方有一些反侦察意识，也可以轻易地在这个层面上消除自己设备与log的相关性，或者直接消除涉事设备。如果对方是临时工，那前面的努力也很可能会是徒劳。最后，从描述看还无法排除自导自演、纯属巧合、楼里其他外人恶作剧的可能性。结合事件的实际影响大小(仅仅局限于知道buzzy身份的人)，权衡利弊后冷处理是合理的。想在技术层面查清这事确实必须有强制力的参与，技术层面的个人调查只能到log为止了，除非某个监控恰好拍了个现行。想形成一定的怀疑，只能通过技术之外的手段了。"
        },
        {
            "mid": "37449036",
            "mtime": "2024-03-02 18:09",
            "mcontent": "不从技术而是一般警方探案方向来讲，下一步就是排查受害者关系网了。问问她最近有没有和什么人起过矛盾吧。"
        },
        {
            "mid": "2504017",
            "mtime": "2024-03-02 18:44",
            "mcontent": "警察不愿意帮忙的话基本查不到"
        },
        {
            "mid": "63782286",
            "mtime": "2024-03-02 19:10",
            "mcontent": "这两个设备一开始使用出厂默认密码，密码就打印在路由器底下，于是被人直接访问并修改了WiFi名称。比较好奇的一点是，修改了WiFi名称以后，这些摄像头还能够自动接入这个WiFi吗？我在百度搜到的答案是不能。这难道不会引起这几个摄像头管理的技术人员的注意吗？如果这些修改有相关的记录，可以让管理人员查看一下日志。"
        },
        {
            "mid": "62073702",
            "mtime": "2024-03-02 20:03",
            "mcontent": "你要个人取证的话就跟，那个地铁上看别人手机查偷拍的一样了。改密码冷处理。"
        },
        {
            "mid": "63018742",
            "mtime": "2024-03-02 21:36",
            "mcontent": "楼主说原本没打算当wifi使用，推测顺手买的两用路由器插线给摄像头。从这个角度考虑，而且名称改变是放假之后，不排除是直接插线改的名称(而不是无线接入进入管理页面)"
        },
        {
            "mid": "731907",
            "mtime": "2024-03-03 01:04",
            "mcontent": "没用过小米路由器，不知道他操作系统是怎么设计的。但只有路由器系统记录了登录进路由器管理的MAC地址，你才能知道是谁登录了路由器。所以呢，你要真想查，首先是把路由器隔离了不要让他继续产生日志覆盖之前的日志。然后你看看有没有留下登录日志。如果你愿意，可以把路由器的全部日志贴上来，坛友帮你分析分析。但从技术上其实挺难的，不如从行为心理学上分析。按楼主的描述，我猜测作案凶手的侧写是：基于对你们公司网络的了解，以及知道你同事Buzzy的大名，绝对是你们公司能与Buzzy产生业务交集的同事。性格内向不擅交际，知道这是个路由器还懂如何改WIFI名字说明对电脑略懂，但竟然改路由器名字说明内心略有变态，更重要的是根据他的WIFI名称的改变，从暴富这种祝福到陌陌甚至脱衣直播这种诋毁，这么明显的内心情感变化，一定是和Buzzy的相处关系变化了，就像从魔兽世界的友善变成了冷淡敌对。如果是工作上，那是Buzzy和谁闹不愉快了？如果是感情上，那Buzzy是有男朋友了？结婚了？还是Buzzy拒绝了谁的好感？这才导致了对方心态的变化。"
        },
        {
            "mid": "60641964",
            "mtime": "2024-03-03 01:55",
            "mcontent": "感谢回复！我理解是：从技术层面上来说，哪怕能定位到修改名称的设备的Ip或mac地址，一方面我们私下也没有正当理由到处去确认具体对应了哪台设备，另一方面也很难从这台设备再追踪定位到具体的某人；所以想要探案的话还是从人际关系上去查更直截了当"
        },
        {
            "mid": "60641964",
            "mtime": "2024-03-03 16:30",
            "mcontent": "的确如此，我们也向技术人员确认了这个是必须得插线还是连接无线网就可以操作的，然后我们下了小米app试了下发现，只要app能连接上设备就能非常轻易地修改名字"
        },
        {
            "mid": "60641964",
            "mtime": "2024-03-03 16:32",
            "mcontent": "感谢回复！虽然感性上很想追问日志查看的方法，但是理性上感觉似乎看了也确实很难有结果……Buzzy确实是个年轻标致的女孩，最符合直觉的可能性就是，这个犯人去年接触过我们，当时设置了wifi名称后，发现一直没引起注意，于是频繁远程修改名称，终于引起了我们的注意，也许现在他发现真的引起注意了反而会暗爽吧直接排查人际关系的话，结合#1坛友的提到的几个可能:首先，自导自演：Buzzy算是个性格比较认真严谨的女生，我们公司同事也是女生居多，而且平时工作摸鱼聊天关系都很好，互相都很信任，几个男同事在这件事情上也都算是值得信任的，出了这个事之后第一反应都是提供解决方法，因此至少在我视角观察之下并没有特别可疑的人；再退一步，大家最近都相当忙碌，也是实在没必要干这么无聊的事；其次，楼里其他外人恶作剧和纯属巧合可以结合分析：我们公司平时客户流动确实会挺多，由于最近几次频繁改动正是年前年后，查找这个时段来往的人相对来说没那么困难，就大致列了下名单，虽然我也心里悄悄觉得肯定是有什么情感纠葛，但其实那些人基本也都是今年新接触的客户，Buzzy看了也不觉得跟他们发生过什么drama的情感纠葛；所以也有可能是：发财暴富是一个去年对Buzzy有好感的人设置的，但随手这么设置完，合作结束无事发生，也就不了了之了，去年结束后也没再接触过；然后到了今年，新来往的人们和或者是楼上楼下公司新来往的人里，有些恰好懂点电脑知识的人或者只是纯粹手机上安装了小米app的人，发现能连上这么个完全没设防的带着一个女生大名的wifi，于是恶作剧地瞎改来……最后解释虽然综合来看可能性相对最高，但是反而更让人心里憋气，可恶啊真就逮不到这个纯坏b了"
        },
        {
            "mid": "731907",
            "mtime": "2024-03-03 17:08",
            "mcontent": ""
        },
        {
            "mid": "63090703",
            "mtime": "2024-03-03 21:02",
            "mcontent": "查路由器操作日志看能不能有mac码，除此之外可能米家app留存的也有操作日志，因为改了wifi名称摄像头一定会断掉要重连的，但是需要找小米的开发人员或者有可能能从本地文件中解析出来。总之，需要专业人员并且费事，还不一定能找到。就算拿到机器mac码也难找到人的，除非能把所有人设备拿来排查，或者操作人设备名称有标识性。"
        },
        {
            "mid": "18729091",
            "mtime": "2024-03-04 02:57",
            "mcontent": "无聊人恶作剧罢了。再说一个人把另一个人的个人信息高调暴露在公众场合，不管是出于什么原因，非蠢即坏"
        },
        {
            "mid": "42978056",
            "mtime": "2024-03-05 17:34",
            "mcontent": "这种路由器一般只有超管权限才可以看到全部的log日志。分成两种，如果是有线连接，其实处理比较简单，查询日志mac和时间日志，时间对应监控视频，mac可以直接找一个局域网控制软件，可以把局域网范围内设备的mac地址全部展示出来，只是针对于没有修改的。如果是无线连接的话，可以看到手机的mac和时间日志，但是手机排查不是很好排查，如果你们有wifi的话，那就得看哪个路由器是否有审计功能了，如果有的话，一样可以展示出来，但是我估计大概率是没有的。"
        },
        {
            "mid": "65625095",
            "mtime": "2024-03-06 09:59",
            "mcontent": "jc不帮忙，我劝你别趟浑水"
        },
        {
            "mid": "60213424",
            "mtime": "2024-03-07 12:15",
            "mcontent": "你已经报警了就不好说了。可以把其他wifi关了，看谁自动连进来这个wifi，记下mac，然后在正常wifi上把这个mac封了，看谁反映连不上公司wifi。"
        },
        {
            "mid": "41765322",
            "mtime": "2024-03-07 12:29",
            "mcontent": "你是技术人员？你和那女的什么关系？你在公司什么职务？从警方来说，除了Wi-Fi 这事没有其他伤害，改名字就类似恶作剧，不好查也没必要查，干嘛不能冷处理？还不如问问那个女的有谁曾经追求过她不好吗？如果有那就有嫌疑，如果有而不说，女的有问题，如果没有，那真的就是恶作剧"
        },
        {
            "mid": "60670550",
            "mtime": "2024-03-07 19:16",
            "mcontent": "什么沸羊羊 别人就不能叫这个"
        },
        {
            "mid": "64984951",
            "mtime": "2024-03-07 21:29",
            "mcontent": "从楼主描述来看，像是有人破解wifi后改的，路由器密应该是弱口令吧？aircrack-ng"
        }
    ]
}