{
    "link": "https://bbs.nga.cn/read.php?tid=39215719",
    "title": "如何开始后端学习？",
    "post_time": "2024-02-05 14:27",
    "uid": "63118290",
    "content": "前端三件套学得差不多了，有c和java基础，最近看到flask的介绍，尝试跟着入门教程写了一个网站。感觉很多东西都看不懂，只是跟着copy代码，教程是10年的，可能是教程问题也可能是我没怎么了解过py。",
    "replies": [
        {
            "mid": "43187732",
            "mtime": "2024-02-05 20:48",
            "mcontent": "java可以看看b站培训班教程，一套下来跟个烂大街的管理系统外卖平台或者电商项目应该差不多。哪个喜欢看哪个，花钱就算了。全栈感觉nextjs，react的多一些？"
        },
        {
            "mid": "61928519",
            "mtime": "2024-02-11 23:17",
            "mcontent": "1. 怎么从零开始学 web 后端的首先得知道对应技术栈的语言的语法。在 GitHub 找了几个简单的管理系统，看看大致功能，猜想需求，看看提交记录。大概知道是怎么玩的。再去找个四小时速通，跟着从零写一次系统，再理解需求，列出文档，再自己写一次，卡顿的地方记录一下，第三次写的时候会感觉顺畅很多，这就对了。再去找个类似的需求，实现一下。感兴趣的功能看看别人怎么玩的，自己加一下，不懂继续搜，直到添加上。暂且先不考虑代码优雅与否的事情。逛论坛，看看各种 web 后端的技术讨论帖，CURD 表，在适合的地方使用适当的语法，之类的。2. 看视频教程吗答了，看个人倾向，有人适合看博客搜着完成，有人适合边看视频边搜博客，有人适合看 20h+ 的细节视频真从零开始学。3. 看文档该怎么看如果是需求文档，先看什么系统，构建一个大致的了解，再分功能模块走，再分流程走，教学用途的这些系统应该不会功能复杂度多高，文档一定可以看懂的，相信自己！如果是看技术设计文档和接口文档，要先理解需求，才能产生足够的联想，帮助理解某块的设计思路。4. 就业导向，除了 Java，讨论的是 web 后端的话，Golang 吧。5. 看不出哪个语言招的人多很看地区，在河南还是河北的大学同学曰，这边招 CS 的是真多，然而我当时在江苏看到的只有招聘 Java 的。Python 的是在其他领域了，后来在广东和上海才看到了很多 Python 相关的 web 后端招聘。6. 全栈工作好找吗？中小企业很多都期望招来 Java 的开发者是能顺便玩明白前端的，通常这类招聘，都是要求 Vue 和微信小程序，然后招进去以后，是写 uni-app...很tm难受。所以，好找，如果你的城市 Java 招聘多，并且你更倾向于学习 Spring 的生态。再额外说一句，React 也不是纯粹的前端开发者才能玩明白的，我认识的很多后端开发者更喜欢 React 的纯粹，虽然 hooks 写的有点...导致页面渲染主打一个慢，不过至少出页面还是很快的，而且客户也不挑剔，二次开发的优化需求反而还能从另一个角度入手开始优化哈哈哈哈哈~还有再问"
        },
        {
            "mid": "63118290",
            "mtime": "2024-02-12 02:54",
            "mcontent": "谢谢老哥这么详细的回答。还有几个问题：1、老哥提到的需求文档是什么？2、目前想学nodejs和express框架作为入门，想问问好找工作吗？3、坐标广州，普通双非学历，因为计算机专业在我们这个医药类学校属于边缘专业，氛围比较差，想找学长学姐咨询考研和工作也无从聊起。我想今年大二暑假靠nodejs在boss直聘之类的网站找份小厂实习，之后再想要不要考研，这个想法现实吗？4、有什么个人方法帮助专注学习吗？现在学web也是，之前做国外的数据结构公开课也是，一是心情不太好，集中力有点差。二是喜欢打游戏，之前打怪物猎人通宵了一晚上报了个蓝桥杯想混个奖还没开始准备，时间有点赶了"
        },
        {
            "mid": "60186590",
            "mtime": "2024-02-13 07:40",
            "mcontent": "听我的，新手直接上rust"
        },
        {
            "mid": "61928519",
            "mtime": "2024-02-13 18:23",
            "mcontent": "1. 需求文档的构成标准，每个团队都大差不离，在聊需求的阶段需要列举业务流程、用例、非功能需求，涉及到第三方 API 的也要列举，基本就是围绕本期迭代的初步企划书。看到需求文档，理解本期迭代内容，才能有下一步的技术文档，都共同确认后，才开始分任务做任务。2. 因为现在讨论的是就业取向，所以建议 op 自己去 BOSS 和 51job 搜搜看广州地区的 Nodejs 开发工程师岗位，大概看一下在 Express、Koa、Nest、Fastify，甚至还有 Egg，等出现的频率，再做最终决定。另外，招 Nodejs 开发者的团队，大都希望你：是全栈工程师(从前后端开发，到测试，到部署)、来了就能干(平替1年经验)、手快(丁真熟练)。再排除就业取向说，学 Express 可以吗，可以，Express 或者任意框架都能帮助你在心理构建一个后端工程开发的模型，写习惯了，再去用别的框架，其实就中间件和 API 有点差异，异步的问题也会减少一点，就，就没了。转是不会很麻烦，或者说反而你会了一个，学其他的会很快。你有 C 和 Java 的基础，应该有发现在学习第二语言的时候，有一些概念是相通的，理解起来很快。3. 现实。4. 得先观察自己，各种专注的场景，分别是什么让你保持住了专注，或者说进入了心流。再从不同场景的答案提取共同的动机。对于我，就是极其沉迷于完成 to-do 上的项所带来的强烈满足感。我会列出年度大计划，一般也就 1-3 个，太多了很容易带来心智负担，我也不是大聪明，打好个人节奏就是最好的自己喽。然后分解任务，到季、月、周、日四种单位。探索未知领域的结果是很快乐，但不是每天都有精力推进，所以合理调控吧。总之就是要多观察自己，不要盲目复刻他人。心情不太好，我个人的经验是，锻炼。撸铁一小时和骑行三小时(速度30中低踏频)给我带来的正反馈应该是和完成 solo project 是一样高的，而且负反馈很低。应该和我打十把 dota 天梯赢十把释放的多巴胺同样多了。个人建议是锻炼，找到自己喜欢的，力量训练也好，跑步也好，骑行也好，都值得一试，在充足睡眠的情况下，刚开始的话，每天分配半小时去享受锻炼应该就很够了。打游戏不是坏事，玩电子游戏算是最廉价的(身体和精神上的消耗)释放多巴胺的方式了吧...蓝桥杯报了就每天做点题呗，用你比赛的语言。双非的话应该是B组，很多题官网魔改，大致计划应该可以是(看 op 好像数据结构并没有怎么学，那可能算法也没怎么学)：a. 每天做两题，不会就写个大致思路，再看答案，看解析，做个总结；b. 第二天复盘前一天的两题，先写思路，再写代码，再跑 cases；一直循环到赛前一周，复盘写过的所有，随便看看各种预测考题的视频，看一眼想想思路，能写能跑更好了。应该时间还是很够的 :)"
        },
        {
            "mid": "61964788",
            "mtime": "2024-03-26 11:06",
            "mcontent": "我的建议是首先学习计算机网络，当然，你大学如果学到还不错，那就可以听从其他人的建议去学那些具体的技术栈了"
        },
        {
            "mid": "63118290",
            "mtime": "2024-03-26 16:13",
            "mcontent": "计网有推荐吗"
        }
    ]
}