{
    "link": "https://bbs.nga.cn/read.php?tid=39617730",
    "title": "关于华为 OD 和自研小公司，求大佬给点建议",
    "post_time": "2024-03-20 14:19",
    "uid": "43064756",
    "content": "楼主坐标nj，毕业于 211 计算机专业，工作五六年了，在目前这家公司待了快两年，前几天华为有个朋友电话联系我问我有没有换工作的想法，我和他说了目前待遇，他说面试表现好的话，来 od 总包可以涨 30%， 他可以内推。目前机考已经过了，考了300+。下一步就是 HR 资面，但是看网上对 od 的评价不太好，面试过了的话也有点犹豫了。目前我还是在职状态，最近几个月卷的不行，大小周，涨薪条件也很苛刻，公积金最低，加班福利也取消了，但是工作应该比较稳定。 有没有大佬给点建议？od 转自有，我这个学历努努力以后有机会吗？ 会随便裁员吗",
    "replies": [
        {
            "mid": "42099147",
            "mtime": "2024-03-20 14:37",
            "mcontent": "没研究过华为OD但是干过外包, 外包驻场就感觉像临时工 在公司没有归属感 工作内容技术含量低  加班比较严重不过外包工资高, 仅仅是稳定的高, 不知道华为的外包 涨薪如何. 我经历过的外包都是不涨薪或是涨幅很小的那种我只是分享一下我曾经做外包的感受,  也没有建议, 这种事还是自己考虑好比较好"
        },
        {
            "mid": "65644158",
            "mtime": "2024-03-20 17:41",
            "mcontent": "上份工作在OD，希望回复可以帮到你。从几个方面回答一下：1、待遇：年终奖 五险一金什么的都没问题，自己待了快三年也拿过年终绩效A。也涨过职级涨过工资，和其他的你听到的外包在待遇这块区别还是很大的，加班也是肯定有加班费的2、工作环境：就和华为正式员工一样，坐一起也没什么差别。差别就是别人可以看心声可以看一些华为员工能看到的你不能。3、转华为：有机会，需要点运气。说点负面的：1、大厂子啥人都有，混日子的会拖垮你。2、氛围很看运气，刚去的时候领导是个情商很高的人，出差了会定期打电话问问生活如何，有没有急事需要回来，加班了只要他在就请兄弟们吃饭。后来换了个领导啥都不懂，只会拍桌子摔耳机，除了ppt搞得好啥也不会。遇到任务就是搞个表格给大家一分，你完不成就是个喷。我们几个兄弟会战出差两个多月天天早9晚2.他来了也没说客气两句就点个头就完了。3、免不了的绩效争议，社会就是如此，很多时候也没有绝对的公平，不过B也照样正常工资和正常年终奖。还有些别的负面的如果你感兴趣可以私聊给你讲讲，但有可能是我的部门的事，不代表整体都是这样，所以不在评论区瞎说了。再说个建议吧，一定让你朋友给你讲实话，他的部门到底怎么样，不行就别去"
        },
        {
            "mid": "42697007",
            "mtime": "2024-03-20 20:59",
            "mcontent": "今天刚下的OD的offer，比上份工资涨了百分之40多，可能是因为面试评级高吧，总体来说薪资肯定是比较满意的，待我进去待一段时间看看什么情况再说"
        },
        {
            "mid": "42669511",
            "mtime": "2024-03-20 21:47",
            "mcontent": "基本没有转正机会"
        },
        {
            "mid": "42669511",
            "mtime": "2024-03-20 21:48",
            "mcontent": "你看是不是属于他的目标院校，不是所有211都可以，就算属于也很难"
        },
        {
            "mid": "42669511",
            "mtime": "2024-03-20 21:50",
            "mcontent": "技术面你也还没面，技术面才会决定你的薪水，而且会根据你上一家工作压你的薪水，你可以先把流程走完了再纠结"
        },
        {
            "mid": "64297229",
            "mtime": "2024-03-20 22:05",
            "mcontent": "华为很多部门默认周一二四九点下班  不过好处是周末加班有双倍工资，面试容易过，钱也多。"
        },
        {
            "mid": "60474355",
            "mtime": "2024-03-20 22:46",
            "mcontent": "od现在基本转不了正"
        },
        {
            "mid": "43064756",
            "mtime": "2024-03-21 01:01",
            "mcontent": "感谢老哥这么认真的回复！我这个朋友说他们部门不是很卷，平时加班不严重，应该是不假的。如果我去了就是他们组的第一个od? 至于部门领导和团队氛围怎么样，这个我还没问他，改天再和他聊聊"
        },
        {
            "mid": "43064756",
            "mtime": "2024-03-21 01:02",
            "mcontent": "是属于目标院校的，技术面还没面，确实得好好准备一下"
        },
        {
            "mid": "43064756",
            "mtime": "2024-03-21 01:03",
            "mcontent": "厉害啊！涨了好多，我朋友和我说拉满也就是30%，请问一下大佬你机考分数和定级可以方便说吗"
        },
        {
            "mid": "43064756",
            "mtime": "2024-03-21 01:04",
            "mcontent": "感谢分享?"
        },
        {
            "mid": "43064756",
            "mtime": "2024-03-21 01:07",
            "mcontent": "好的 最近好好准备一下技术面 有结果我会更新一下！"
        },
        {
            "mid": "65276039",
            "mtime": "2024-03-21 07:39",
            "mcontent": "同坐标nj，已经od两年1，工作地点，南研所内部，跟自有一样，没啥区别，工作时间，食堂吃饭一样，没啥区别2，薪资待遇，看你定级了，这边就不说了，同等级跟自有比，还是会少很多的，如果你是你们组唯一od，那你混熟后，会发现你是最低的3，升职加薪福利，od不跟自有一起评绩效，会跟整个大部门的od评，a很难，基本都是b。除非你主动去跟你领导说，要加薪，领导才有可能会给你加个10%样子，而且各种pua加大饼。福利看部门了，去年过年我们部门啥都没发(\"\")4，工作时间，基本124晚上工作到九点，义务劳动不算加班费的，月末周六，或者给你申请加班才会有加班费。5，自我提升，看个人，学习材料很多，内部也有很多好的博客，但没时间，来工作又不是让你来学习的。6，其他，要来的话，心态要放平，抱着给钱打工的心态就好，跟自有薪资福利还是差距很大的，千万不要觉得领导一视同仁，领导对待自由和od还是有区别的。各种文件帖子也是没有权限看的，顺便说一句，现在没可能转自有，而且自有的工作压力绩效压力更大。"
        },
        {
            "mid": "65406432",
            "mtime": "2024-03-21 10:08",
            "mcontent": "现在环境是真的差，211计科都只能去华为od，互联网行业真是没救了"
        },
        {
            "mid": "43064756",
            "mtime": "2024-03-21 14:48",
            "mcontent": "可能是我比较菜，本以为小公司会没那么卷，其实也差不多。如果付出同样的努力，od 给的回报多一点的话我觉得可以考虑尝试一下"
        },
        {
            "mid": "12371837",
            "mtime": "2024-03-21 19:22",
            "mcontent": "NJ od，只能说组和组之间差别很大。我们组算不太卷的，一二四八点半，其他时间五点半，基本上也就发版本的时候忙一点。od吹水群里有天天10点11点下班的，也就每天8小时工时不加一点班的。升级加薪体感比自有慢，转自有别想了，通道暂时关闭了。就当个普通工作吧，好不到哪去也差不到哪去。"
        },
        {
            "mid": "64219520",
            "mtime": "2024-03-23 19:11",
            "mcontent": "这个就看组了，现在也可以多面面"
        },
        {
            "mid": "65458902",
            "mtime": "2024-04-07 00:44",
            "mcontent": "od加班有没有加班费看部门吧"
        }
    ]
}