{
    "link": "https://bbs.nga.cn/read.php?tid=39924842",
    "title": "求助大佬，十分紧急",
    "post_time": "2024-04-20 14:18",
    "uid": "62772827",
    "content": "请问各位大佬，手机删除的通话记录和微信聊天记录还有恢复的可能吗？小弟通过各种软件搜索恢复服务，但看了好多评价都说是骗人的，所以请问大佬们有恢复的可能吗？如果有怎么操作比较稳妥，身家所系，拜谢了！",
    "replies": [
        {
            "mid": "62697426",
            "mtime": "2024-04-20 22:30",
            "mcontent": "手机删除的通话记录和微信聊天记录，首先不要开机，保持关机状态，否则盘里的数据可能会被覆盖了其次，所谓数据恢复软件，基本都是骗人，而且可能会造成盘内数据覆盖再者，删掉的能救回来，要送到专门机构，人家是用特殊工具，拆机恢复，费用在5万到60万普通人就别折腾了"
        },
        {
            "mid": "62772827",
            "mtime": "2024-04-21 01:34",
            "mcontent": "当真吗大佬？这个价格能接受，有指路吗"
        },
        {
            "mid": "62697426",
            "mtime": "2024-04-21 10:15",
            "mcontent": "那就找国家官方机构国家信息中心数据恢复中心，公//安，司法所也有做数据恢复的部门这种大额的，线上咨询，线下去实地摸点，合同记得约定，数据恢复到什么程度，结款到什么程度你要是不差钱，就再买个手机，(一定要买跟你原手机，同规格，同大小，同cpu的)写入通讯记录，短信之类的信息，然后 删掉让你选的机构，先恢复这个假手机的数据，看看能恢复到什么程度满意了，再上真手机，当然，这么搞，要出2笔钱因为数据恢复的过程，很容易对手机的电子数据造成二次伤害另外，美国那边也有官方的能做数据恢复，好像对于数据多次擦写，也有恢复手段，由于需要的设备仪器很高端，人家是否接跨国客户的单，这你得再问问了这个行当，客户很窄，总之一点，原手机千万别开机了！！！盘里的数据被多次读写，要恢复，可就难多了最后，再补充一点，这个过程很折腾人，而且最后数据恢复的比例，很可能到不了100%，我不清楚，你对原手机在删除数据后，做过什么操作，最后恢复数据的比例不能报太高期望"
        },
        {
            "mid": "62772827",
            "mtime": "2024-04-21 10:32",
            "mcontent": "感谢大佬的详细解答！我去以上几个机构咨询一下，我就是想恢复21年10月的通话记录和22年3月的微信聊天记录，东西不多，但非常非常关键"
        },
        {
            "mid": "62697426",
            "mtime": "2024-04-21 10:38",
            "mcontent": "还有一条道通话记录，比如说你是移动的号，移动的后台服务器，是保存你的通话记录的微信聊天，人家微信后台也有全部保存，当然微信不会承认后台保存的所以，你也可以找移动官方的人和微信官方的人至于他们能否有权限，或者敢给你开这个口子就要看你的能量大小了这条道，比折腾手机数据恢复，要容易点"
        },
        {
            "mid": "62772827",
            "mtime": "2024-04-21 10:43",
            "mcontent": "这个就太难了，不过有个情况我不知道能不能再单开贴问问，就是之前因为其他原因A把自己和B的微信聊天记录有选择地删除了，但是B把A的手机拿过来不知道怎么操作了一下，完整的聊天记录又回来了，但是现在联系不上B了，所以我也特想知道他怎么操作的"
        },
        {
            "mid": "62697426",
            "mtime": "2024-04-21 10:55",
            "mcontent": "如果是过去的，能恢复，那很可能是之前B或者A做过备份和迁移，所谓恢复，就是把之前备份过的聊天记录，又恢复了，这个你可以找个新手机，测试下这个过程如果是当时最新的聊天记录，删掉了，还能立刻找回来，而且还没做过备份和迁移，那你该考虑，这个手机是不是被动过手脚了"
        },
        {
            "mid": "24154006",
            "mtime": "2024-08-13 15:29",
            "mcontent": "额，如果电脑有登陆过，可以直接同步到手机里。"
        }
    ]
}