{
    "link": "https://bbs.nga.cn/read.php?tid=39604378",
    "title": "一只迷茫大二学生的求助",
    "post_time": "2024-03-19 00:20",
    "uid": "64775766",
    "content": "#程序员# #后端# #大学生#",
    "replies": [
        {
            "mid": "65037130",
            "mtime": "2024-03-19 00:37",
            "mcontent": "我觉得你现在大二，重点应该是打好基础。你既然也说了不想做crud程序员，那你趁着本科应该做的是掌握好数据结构、操作系统、计网、数据库、编译原理、分布式系统等等这些内功，从代码层面上理解这些东西而不是停留在背八股。你提的那些应用层面的语言和框架之类的事情完全不急，要学也花不了多久的"
        },
        {
            "mid": "63958932",
            "mtime": "2024-03-19 08:13",
            "mcontent": "你上面打的那些名词，如果你很熟，去大厂实习轻轻松松。可以发我简历"
        },
        {
            "mid": "34907127",
            "mtime": "2024-03-19 09:09",
            "mcontent": "虽然不是专业码，但我觉得你大二有这个实力基础，先别死钻那些工具链和前后端框架吧...学学理论，看看架构，想想设计，追追新潮，不一定需要实践，网上看些东西了解下思路，基本原理，优缺点，关键是视野要广。你之前尝试的那些项目不要只停留在跟着教程一步步会做，多想想为什么这么做，有没有其他方案，优缺点是什么。本科期间尽量拔高眼界的想法是对的，我个人觉得学生期间高屋建瓴地了解更多领域的基础知识相对于掌握几个工具对长远发展更有用。大家都嘲笑八股文，但真正能够凭经验和理解而不是背答案把八股文答好的那是真正的大佬。讲个不太恰当的比方，审美，工程，力学，设计对于建筑师而言，比打灰砌墙要更重要。当然这一切的前提在于你有足够扎实的代码基础和实践能力，真正要用的时候(比如毕设、实习、面试等)可以足够快速地从你认知里找出合适的方案和工具并应用落地，不过你大二就上手玩过这么多东西了，这方面应该没啥大问题"
        },
        {
            "mid": "64775766",
            "mtime": "2024-03-20 01:08",
            "mcontent": "谢谢老哥的建议，知道基础的重要性，所以我上边也说，在大三的时候就是主要转向内功的学习，四大件啥的啊。现在学的这些主要是为了能参加比赛啥的。其实还是迷茫在没见过大家的水平，不知道自己的实力怎么样，也不知道这些学完了能不能达到自己想要的高度，所以一直处于一个很惶恐的状态。"
        },
        {
            "mid": "64775766",
            "mtime": "2024-03-20 01:16",
            "mcontent": "谢谢这位老哥，但是看到网上说的那么卷又有点害怕，而且上边也说了没什么眼界，所以也不知道您这个所谓的熟练到底是什么程度。先加个联系方式可以不。"
        },
        {
            "mid": "64775766",
            "mtime": "2024-03-20 01:27",
            "mcontent": "感谢老哥，关于拓宽视野我也想过许多，但是在信息茧房的情况下，我很难获取到一些emmmm，新的东西，而且正是因为眼界的原因，我不知道有什么新的工具，我也不知道有什么新的理论，就好像一个色盲，我完全不知道有哪些颜色，我也不会形容。所以搜索的时候也不知道从何下手，关于这点，您有什么建议吗？"
        },
        {
            "mid": "63283296",
            "mtime": "2024-03-20 09:35",
            "mcontent": "可能该想想怎么让你简历过得了大厂关，现在感觉能进面都挺难的，反正才大二，去找点比较难点的课或者项目看看试试？"
        },
        {
            "mid": "42099147",
            "mtime": "2024-03-20 14:27",
            "mcontent": "校招看的都是原理 底层 基本功java岗 基本围绕着 多线程 jvm 回收算法 集合这些由简入深的问 反而流行技术问的没那么多, 项目可以不着急下手 学习一下spring全家桶源码基本上就可以了服务端的岗位 数据结构 数据库 计算机网络 网络编程这些问的也很多在校期间多打基础, 把原理搞明白了 应用层的技术可能到校招的时候又更新了, 现在研究流行技术又不去项目实践 完全是在浪费精力"
        }
    ]
}