{
    "link": "https://bbs.nga.cn/read.php?tid=38724440",
    "title": "大专大二大数据技术与应用求问规划",
    "post_time": "2023-12-18 06:17",
    "uid": "64887389",
    "content": "大专大二，25年毕业，就业形势如此严峻，不得不焦虑迷茫。",
    "replies": [
        {
            "mid": "61507137",
            "mtime": "2023-12-18 11:09",
            "mcontent": "作为一个已经混了三年的本科IT结合本人在企业混的这几年谈谈关于前端和运维，首先本人在研发、测试、维护都混过。研发前端那块比较卷，你见过有人连续两个月加班的吗？至于运维只能说比较好混，但是比不上测试的清闲。然后根据本人在这几年的经验给你的建议，首先你的履历放在中小型公司里已经属于是递了就能上的程度，但是因为你的学历原因会大幅度的压你的工资。所以个人推荐先上研！本科只能是合格，想拿到大厂的offer研究生是最低的门槛(如果你是实习的话有两三个国奖也差不多)。根据我组大佬的说法，人工智能绝对是重点关注对象，有能力的尽量往那边靠，这东西只要完善出来其他岗位就得死。所以你学别的能被人卷死，但是你学人工智能绝对不会卷死，除非有巨佬能在20世纪把这东西给完善了。但是现在人工智能的岗位都只在大厂存在，所以我建议一定要去考研。如果你不打算考研，我跟你说一下这几年的见闻你自己考虑下吧。首先是前端，前端的就业机会大部分集中在IT公司，但是这几年接到的单子少了一些,我区的一些公司都撤走了不少，但是每月的单子数量依旧不多。至于运维岗位，根据我的一位离职老哥的话：做梦都没想到有一天能因为自己的工作经验进国企。(羡慕死我了)然后就是测试岗位！可能是因为我在的公司比较小吧，公司里就一个测试组，每天的工作内容就是测试开发的东西，然后每天小晨会汇报一遍 ，基本没有啥事。但是根据组内的同事说前几年单子多的时候排的计划能到两个月后。好了老哥我也就干过这几个岗位，研发跟了六七个项目，感觉太累了申请调了，维护混了半年领导觉得人太多了拆了一批混到其他岗了，测试岗位以我目前的感觉就是混日子，但是待久了真不是个事，我现在看个泄火网站都下意识的去做个压力测试。"
        },
        {
            "mid": "64887389",
            "mtime": "2023-12-18 19:22",
            "mcontent": "感谢老哥的回复，我也是偏向于去当个运维 测试先混一下实习，有什么运维是可以快速上手的吗，sql boy?我自学能力还可以。但是说到面试中小型企业就会招，我还不这么认为。因为我去面过校招，好像不是很有意愿。可能是因为我是大二?我计划专升本，本科就搞嵌入式。但考不考研搞人工智能，这条战线就对于我来说拉得太长，所以我先想着能够有份工作活下来，业余时间去发展。"
        },
        {
            "mid": "41802541",
            "mtime": "2023-12-22 14:14",
            "mcontent": "升本转运维或者嵌入式 本科想搞大数据很难更不用说专科了"
        },
        {
            "mid": "61605006",
            "mtime": "2024-01-10 10:54",
            "mcontent": "非科班双非研究生能搞吗"
        },
        {
            "mid": "63551890",
            "mtime": "2024-01-10 22:20",
            "mcontent": "有拿得出手的期刊论文吗"
        },
        {
            "mid": "61605006",
            "mtime": "2024-01-11 09:53",
            "mcontent": "]有核心期刊的论文，但是也不是计算机方向的啊。。因为我们答辩条件是要发核心期刊，所以就投了个本专业的核心期刊。。"
        },
        {
            "mid": "64846580",
            "mtime": "2024-01-12 09:58",
            "mcontent": "你项目经历多 海投 会遇到不看学历的hr不要轻易放弃 学历低更要多学习 java不用精通但至少要掌握基础"
        },
        {
            "mid": "65481441",
            "mtime": "2024-01-12 16:16",
            "mcontent": "先升一下本科吧，再后面看看行情的情况是从事IT还是考公"
        },
        {
            "mid": "60366949",
            "mtime": "2024-01-12 17:54",
            "mcontent": "本科做大数据开发都很难，只能去外包。可以看看大数据运维，比普通的运维发展前景好点。数开的话就是SQLBOY。搞离线或者实时的数仓。如果要走大数据的话就你这学历还是走大数据运维好点"
        },
        {
            "mid": "62035835",
            "mtime": "2024-01-14 17:30",
            "mcontent": "编辑了，离题了"
        }
    ]
}