{
    "link": "https://bbs.nga.cn/read.php?tid=39843413",
    "title": "LLM这玩意的价值是真的看不出来还是装傻呢",
    "post_time": "2024-04-12 11:22",
    "uid": "63453772",
    "content": "总感觉在nga这个论坛有种工业化AI才是真神，其他如文字处理，文字理解，人机交互，电脑视觉，音频视频生成类的AI都被打成奇淫巧技。",
    "replies": [
        {
            "mid": "62767347",
            "mtime": "2024-04-12 11:35",
            "mcontent": "支持工业化AI的本质是支持“在不影响人自身的前提下，生产力的解放和提高”。人不愿意在当前的工资水平下去流水线打镙丝，就用AI来填补这一块，原来的人已经待业在家或者转行了，AI的入场没有损害人的利益，产出的产品还给更多的人带来了利益。支持AI助理则相反，当前的人类愿意在当前的工资水平下坐办公室，且当前的办公人员规模足以满足市场需求，AI的入场并不能扩大市场，新增的生产力终究会回落到正常水平，但是这期间被AI代替掉的人类却无法回到岗位上了。当前的AI水平，不论应用在哪个生产生活场景，都会给生产力带来提高，但是地球上还没有拿出一套与更强生产力相符合的新生产关系。没有配套生产关系的调节，AI就只有参与那些人不愿意做的事情才不会对人的利益造成损害。生产关系对生产力的反作用，只是历史上的几个字，但对于正在经历历史的人就是一幕幕惨剧。"
        },
        {
            "mid": "62697426",
            "mtime": "2024-04-12 11:39",
            "mcontent": "编辑了~~~~~~~"
        },
        {
            "mid": "63453772",
            "mtime": "2024-04-12 12:01",
            "mcontent": "你说的有一定道理，但和主题么啥关系吧……还有如按你所说，别的不知道，至少在我的工作范畴内LLM是把不可能变成了可能，拓展了新的之前本来不存在的领域/行业，在现行体系下是生产力的补充更是开发新的生产资料，那是功德满满喽？"
        },
        {
            "mid": "63453772",
            "mtime": "2024-04-12 12:07",
            "mcontent": "Q*还是比较幻想，现在也是谈GPT5不谈AGI或者AI逻辑了。肉眼可见的一条路是虚拟世界，现有AI在模拟碰撞和光效上实在牛逼，真把人放在全虚拟下感觉是穿越这种也是非常可能的……硬件设备上马斯克那个炸裂的脑机接口最新成果展示，苹果这个vision pro，作为完全普及化产品有待进步，但作为POC已经很合格了……"
        },
        {
            "mid": "62767347",
            "mtime": "2024-04-12 12:25",
            "mcontent": "我对于大语言模型的价值视而不见的原因是这玩意短期内虽然无法损害我，但是会损害别人。长期来看，随着被损害的人越来越多，早晚轮到我，或是被损害人的人力量越过了一个关键节点，雪崩的时候对所有人平等地造成巨额伤害。这样的局面我不愿意见到，所以我对其优点视而不见，不会卖力推广，只会自己也用一下，让自己被损害的时间节点向后推迟，并等待新生产关系的出现，或者是泄压阀的出现。对于后面的内容，我只是一个AI使用者而非AI的开发者，相关的知识储备不足，所以无法回答。对于是否功德无量，我只能说，以未来的视角，AI必然功德无量，可惜我是现在的人。以当代的视角去看过去的工业革命，当然会觉得是时代前进的方向，可如果你是一个平凡的，一天14小时劳作而精神恍惚摔进钢水里面的工人呢？"
        },
        {
            "mid": "63453772",
            "mtime": "2024-04-12 12:38",
            "mcontent": "有一定的道理。我理解你的想法，但我认为让人不被技术浪潮打翻的根本在于能不能加入，例子如铁匠学习机械生产进入工厂，纺织女学习纺织机进入工厂，原本行业在技术碾压式更新后找到一定的立足点，而不是通过拒绝抵抗技术革新死守观念被淘汰。还有技术进步后人对“手工艺品”和“高端定制”的某种热衷，也是另外一种出路。可能以后就是“100%纯手工打代码”什么的其实你也点出了我挺绝望的一个点，在算力基础上A I终究会被掌握在拥有算力设备的个体手里，而这些个体无论是个人还是集团都拥有几乎全部的新型生产资料-算力。相比过往如原料这类生产资料，算力本身就具有技术门槛，这技术门槛决定了它就不是一个能普及的东西……然而通过算力完成的生产工作上的议价权就完全掌握在算力掌控者(目前来看就是资本家)手里，反乌托邦之一的特拉斯就在历史的拐角处，而我看不到为什么资本不会这么做，以及各国政府能怎样打破这样的局面。"
        },
        {
            "mid": "62767347",
            "mtime": "2024-04-12 13:04",
            "mcontent": "质疑挑错的人本质上是在帮忙完善这一方案，而理想中更好的制度没有经过大规模的社会实践，必然存在更加巨量的隐藏风险。在有足够体量的国家愿意牺牲自己来实践并完善其他方案之前，生产资料公有制是当前地球唯一有那么点可行性、风险相对可以预知的出路。"
        },
        {
            "mid": "62697426",
            "mtime": "2024-04-12 13:19",
            "mcontent": "编辑了~~~~"
        },
        {
            "mid": "5254815",
            "mtime": "2024-04-12 22:05",
            "mcontent": "但凡说 llm 不好的都是没有尝到甜头的。我这边从 Transformer 之前就在跑各种数据量化，因子挖掘，有了 llm 之后可以几十倍的效率训练，到现在规模做到 2016 年时候的几百倍还不需要多几个人来开发新算法。甚至准备把苦力都干掉。每年节省上百万刀的支出。现在挖掘，架构，训练，冻结 encoder 等等都可以用我们自己的模型自己生成，全程不需要人参与，包括单测，白盒是否通过，测试数据和分析也是模型全自动。"
        },
        {
            "mid": "63958932",
            "mtime": "2024-04-13 08:07",
            "mcontent": "直接看llm相关的岗位给多少工资就行，资本家可不傻。这还用多评价啥"
        },
        {
            "mid": "62073702",
            "mtime": "2024-04-14 19:08",
            "mcontent": "我是持悲观态度的，因为目前用着gpt4只问答的话感觉也就那样，感觉目前可能达到的终点就是某些已有软件的增强，例如更加好的翻译软件。我个人是更加倾向于 类似 元宇宙 之类的东西，以前就有，只不过以前不叫元宇宙，叫vr。价值也就那样。等完全落地了再说吧，不落地，就跟费力杠杆一样，然后自己用着费力杠杆还要嘲讽人工，说为啥不用ai呢，肯定是ai没人工省钱"
        }
    ]
}