{
    "link": "https://bbs.nga.cn/read.php?tid=38975000",
    "title": "关于游戏投资请教",
    "post_time": "2024-01-12 15:49",
    "uid": "60006499",
    "content": "本人游戏热爱者，但由于个人原因无法抽身进入这个行业，但是对这个行业很有热爱",
    "replies": [
        {
            "mid": "65481441",
            "mtime": "2024-01-12 15:55",
            "mcontent": "学历，历史成绩。而且投资也要根据阶段性。出阶段性成果了 打一部分。然后循环往复 不能一股脑全给了。如果投资额度不大的话，就没那么严谨"
        },
        {
            "mid": "60006499",
            "mtime": "2024-01-12 15:59",
            "mcontent": "感谢建议"
        },
        {
            "mid": "42252406",
            "mtime": "2024-01-12 16:55",
            "mcontent": "游戏这一行只看产品，没有产品再怎么吹都不行。它是一个复合产业，有点像电影业。美术 程序 文案三个都有分量。"
        },
        {
            "mid": "41351500",
            "mtime": "2024-01-12 17:50",
            "mcontent": "1，团队核心成员的过往履历，蛮重要的，一个磨合成熟的核心团队能在前期在方向敲定后很快就有产出。而且如果团队新项目是之前做过的同品类，也能在新项目里规避掉非常多的设计坑，也就是节省很多学费2，团队核心对于即将开工的游戏项目的定位和思考，既包括游戏相关的玩法和内容，也包括外部市场的认知和趋势的研判，不知道你看中的团队是做商业手游还是独立买断，二者虽然都是游戏不过落地细节上天差地别3，小心混子团队，尤其是游戏核心主创，如果只会夸夸其谈，但是落地设计完全不懂的人。这类如果你自己比较懂，多追问基本上能发现，要是你不懂那最好找个懂行的朋友给你把把关"
        },
        {
            "mid": "43359603",
            "mtime": "2024-01-16 11:12",
            "mcontent": "建议多找些独立游戏制作者聊聊，比如b站王老菊，付费咨询这哥么几百万自己做游戏，烧了个寂寞。还有有些游戏喜欢套理念，通过游戏表达这个理念，实际上并没有什么用，玩家接触的只是数值，玩法罢了，除非你是真的低交互，观影类游戏。"
        },
        {
            "mid": "60754431",
            "mtime": "2024-01-16 11:28",
            "mcontent": "建议多找游戏团队看看再说，不要盲目头，游戏太烧钱了，而且还看得团队人员水平，过往经历，以及是否成熟出过游戏等，市场如何，都是问题。还是不太建议盲目投。"
        },
        {
            "mid": "1225416",
            "mtime": "2024-01-16 18:43",
            "mcontent": "某M厂制作人，前几年被人推荐去广州救火，一千万多点的成本都够给某个亏了几个亿的IP把亏的部分补回来了关键是要遇到真的有成功项目经验的人带的团队，脑子清醒不是单纯看到什么火就跟风试着做什么的不然像完蛋了那家那样，做火了之后现在又开始作死盲目扩张了，还一堆智障跑去跟风的，准备亏到底裤都不剩吧"
        },
        {
            "mid": "64846580",
            "mtime": "2024-01-19 01:46",
            "mcontent": "别看学历 看demo 看作品集"
        },
        {
            "mid": "60006499",
            "mtime": "2024-01-19 16:47",
            "mcontent": "感谢各位热心回复！！"
        },
        {
            "mid": "61182025",
            "mtime": "2024-01-19 19:12",
            "mcontent": "找个业内朋友一起评估，我在小团队待过，出一套骗投资人的Demo或者各种自信吹牛逼对于团队来说手到擒来，你如果没在行业内干过，很容易被唬住"
        },
        {
            "mid": "60027817",
            "mtime": "2024-02-26 06:22",
            "mcontent": "楼主你投了么？最近我也在关注这块，"
        },
        {
            "mid": "39357296",
            "mtime": "2024-02-26 07:23",
            "mcontent": "我干过游戏策划，大部分成熟的团队也有骗投资的嫌疑，因为给你吹的产品和你最终拿到的完全不是一个产品。大概就是想做3渲2虚拟日式女偶像，最后成品是3d劣质版qq炫舞的这种差距。所以我自己自学程序后自己立项目自己准备做游戏。没钱也做。而且我不会要任何人的投资，除了我妈投的钱，因为我想盈亏自负，我要独吞全部收益，承担游戏可能暴死的全部风险是应该的。以前我总想着拉投资，但觉得找不到门。现在真心想做，反而不可能要任何外人的投资了。我觉得真心想做小体量游戏的团队，一般不会要外人的投资。除非对方主创团队有野心，要做大体量游戏，主创团队自己贷款和抵押了房产的钱也不够搞研发，才会需要外面人的投资。我觉得想投资游戏这种事情不靠谱，还是拿着钱干点儿别的啥，反正我是不会投资游戏研发团队的。"
        },
        {
            "mid": "2504017",
            "mtime": "2024-02-26 11:48",
            "mcontent": "曾经的从业者表示看看主程和美术的履历基本能判断个大概"
        },
        {
            "mid": "61884317",
            "mtime": "2024-02-26 16:44",
            "mcontent": "没有程序能力那你只能看看美术的作品和主策带过什么项目了"
        },
        {
            "mid": "37449036",
            "mtime": "2024-02-26 17:40",
            "mcontent": "看产品，让他们给你过去的作品让你玩玩。当然前提是你的游戏品味比较大众。游戏团队很难从一个点上看出水平如何，有水平的在里面当混子或者擅长的地方项目里基本用不到那也白搭。最直白的就是看看过去的项目。而且游戏这方面说实话，很多时候美术和宣发比程序员实力重要，做个ppt骗众筹甚至不一定需要团队有个程序员。"
        },
        {
            "mid": "60058968",
            "mtime": "2024-02-26 17:43",
            "mcontent": "我觉得老哥说的很对，游戏这种高杠杆赢家通吃的行业，有信心的营运主体只有在举债都吃不下的情况下才会选择求助外部。如果没信心，自己都不allin，那干嘛不去打工？不就是骗钱么？你有二十年赌博经验，去赌场赢率超过50%，你会不会要别人来投资你？即使你手头只有20块？陈刀仔20块赢3700万，他要人投资了么？"
        },
        {
            "mid": "63827484",
            "mtime": "2024-02-26 17:49",
            "mcontent": "学历不错，工作经历也是大中型公司，就是做不出来游戏进项目一看，好家伙，一年多了，除了插件就是网上抄的开原坑挺深的"
        },
        {
            "mid": "2389295",
            "mtime": "2024-02-27 18:24",
            "mcontent": "楼主投了么 我十多年游戏行业经验，不说帮你稳赚钱，肯定可以帮你避坑"
        }
    ]
}