{
    "link": "https://bbs.nga.cn/read.php?tid=39648390",
    "title": "吐槽一下，怎么感觉被学校坑了",
    "post_time": "2024-03-23 11:49",
    "uid": "61583165",
    "content": "rt，楼主是个双非一本的学生，这学期刚开始学校把一些上学期成绩靠前的人分成了若干组，然后又给每个组分配了一个导师。在两周前本组导师给了我们若干个项目让我们选一个，我们选的是“基于蓝牙的课堂自动签到系统”，导师给出的文档上明明白白的写着：",
    "replies": [
        {
            "mid": "62767347",
            "mtime": "2024-03-23 12:28",
            "mcontent": "看起来是手机应用开发，终于刷到我会的地方了，以Android为例子给你讲讲。首先我不是很懂你们的规则，不太确定一定要完全按照老师给的文档来做吗？或者自己提一个题目行不行？# 完全按照文档来做如果一定要按照文档来做，可以把targetSdkVersion改低到能获取的那一版，然后找旧手机旧系统进行演示。这种做法就是赌一个评委完全不懂技术。# 不必安全遵从老师给的文档如果不必完全按照文档来做，那么在符合标题的情况下，蓝牙不能动，mac地址可完全没在标题里提到哦，只要有别的信息可以实现和设备一对一映射，只有极小概率出现重复，就可以了。我随便举2个例子，你也不要局限于这两种，还有很多方案的。## 方法1你自己随机生成一串字符，存到APP的内部私有目录下。打开APP之后，检查这个目录，没有就说明是新安装的/清除过数据，给他重新生成一个，然后连接到服务端(不一定非要服务器，你找一个手机做这事也行，毕竟后面还要用蓝牙呢)更新一下这个人的信息。后续蓝牙连接的时候就用这个东西代替mac进行传输和判断。## 方法2既然是课堂签到，学号、姓名什么的肯定有的吧，MD5一下，或者不MD5直接明文传输也行，反正学号+姓名肯定不会在演示场景中的一个课堂内部重复了。# 彻底抛弃老师的文档，自己造题目蓝牙连接之前，需要先发现设备，然后如果是经典蓝牙还需要先配对，其中“发现设备”是个很重量级、很耗电的事情。要实现“无感”，就要在有课程安排的时间(比如说整个白天)一直开启蓝牙发现，以便一进入教室就能找到对应的蓝牙服务端，然后连上去传输数据。还要维持APP不被系统杀后台，一整天下来怕不是耗电量比微信还多，续航杀手了属于是。自己造个题目，实现无感或者轻微感知的课堂签到吧，手机NFC(软硬结合？)、人脸识别(APP调用SDK，基本算是纯软件实现)、传统的刷IC卡(偏硬件方向)之类的？反正哪个都比蓝牙强，起码这几个不会因为蓝牙设备重名导致签到别的教室去。最后再说一下，评委老师有极大概率是老师在社会上认识的一些公司的员工、中基层管理人员，老师找他们来做评委可能只是含含糊糊的讲一下来给学生指点指点，并不会告诉他们“题目都是老师自己出的，代码也是老师提供的，学生只是改一改，学一学”。没必要把评委的话太当回事，毕竟两边的口径都对不上。你只要参与了就有收获。"
        },
        {
            "mid": "61583165",
            "mtime": "2024-03-23 17:36",
            "mcontent": "谢谢大佬回答，业内人士就是不一样，几句话让我醍醐灌顶。比我们吹一个多月牛结果啥事不干的导师强太多了。截至目前，我发现蓝牙槽点太多了，感觉就是不如wifi。现在基本要么按方案一二传字符串做个app糊弄老师要么彻底抛弃蓝牙搞别的。nfc,人脸识别或者学生卡打卡器随便一个都比蓝牙强，准备挑个成本低一点的试试。还有上大学后终于体会到小组作业只有组长写的绝望了"
        },
        {
            "mid": "61583165",
            "mtime": "2024-03-23 17:37",
            "mcontent": "谢谢大佬回答，业内人士就是不一样，几句话让我醍醐灌顶。比我们吹一个多月牛结果啥事不干的导师强太多了。截至目前，我发现蓝牙槽点太多了，感觉就是不如wifi。现在基本要么按方案一二传字符串做个app糊弄老师要么彻底抛弃蓝牙搞别的。nfc,人脸识别或者学生卡打卡器随便一个都比蓝牙强，准备挑个成本低一点的试试。还有上大学后终于体会到小组作业只有组长写的绝望了"
        },
        {
            "mid": "5254815",
            "mtime": "2024-03-24 04:37",
            "mcontent": "蓝牙的选题是谁想的？你多看看钉钉是怎么做的，不是刷脸就是多态"
        },
        {
            "mid": "61583165",
            "mtime": "2024-03-24 08:03",
            "mcontent": "导师想的"
        }
    ]
}