{
    "link": "https://bbs.nga.cn/read.php?tid=40302873",
    "title": "[讨论] 服务器软件防ddos",
    "post_time": "2024-05-25 16:41",
    "uid": "63608356",
    "content": "如果服务器上跑这样一个程序：",
    "replies": [
        {
            "mid": "731907",
            "mtime": "2024-05-25 21:26",
            "mcontent": "100个人里有人掉线了怎么办"
        },
        {
            "mid": "63608356",
            "mtime": "2024-05-25 21:57",
            "mcontent": "尝试重连超时后连接计数减一"
        },
        {
            "mid": "731907",
            "mtime": "2024-05-25 23:22",
            "mcontent": "就跟餐厅取号排队一样，98号叫到的时候没来，等他再来已经138号了。然后还要排38个？"
        },
        {
            "mid": "63608356",
            "mtime": "2024-05-26 00:37",
            "mcontent": "我是针对有恶意连接攻击的情况，正常情况连接数不会超过设定值，受到攻击会突然增加大量连接一下超过这个值很多然后被ban掉，这种情况要是掉线而且没法重连那就只能等攻击结束了再连接了不过我想如果攻击流量撑爆了带宽会不会出现在IP白名单里也连不上的情况"
        },
        {
            "mid": "37387113",
            "mtime": "2024-05-26 03:45",
            "mcontent": "到了drop包这一步就已经算中ddos了，其余的操作都只能多苟活一会"
        },
        {
            "mid": "41525142",
            "mtime": "2024-05-26 07:22",
            "mcontent": "如果你的服务只对某些ip开放的话白名单可以用，但是面对大规模的ddos攻击白名单也没什么用。防火墙检查ip地址本身也是占用资源的，流量足够大的话什么都给你冲烂了。面对这种只能用成熟的业界方案(本质就是加服务器)。"
        },
        {
            "mid": "63608356",
            "mtime": "2024-05-26 09:24",
            "mcontent": "那多少也是有作用了，至少可以应对小规模的攻击？能拉高攻击成本也是有意义的，现在就是有没有现成的开源软件可以用"
        },
        {
            "mid": "41525142",
            "mtime": "2024-05-26 09:46",
            "mcontent": "假设攻击者猜不到你的白名单的话是可以的，不然伪造ip也很简单。其实这就和防dos没什么关系了，就是单纯的防火墙白名单功能。楼上有人说的对，到了本地要drop其实攻击者占用你资源的目的就已经达到了。没有开源软件是因为这本质上就不是软件能解决的问题，是ip协议的设计缺陷，只能靠大量服务器/代理挡在真正的服务器前面分担。"
        },
        {
            "mid": "63608356",
            "mtime": "2024-05-26 09:55",
            "mcontent": "细说伪造IP还能做到这种事？"
        },
        {
            "mid": "41525142",
            "mtime": "2024-05-26 10:06",
            "mcontent": "ip不带验证机制，想伪造就伪造。如果上层是TCP的话握手环节过不去，但是会占用服务器资源。如果是udp的话，从服务端没办法区分是伪造的还是真实的。"
        },
        {
            "mid": "63608356",
            "mtime": "2024-05-26 10:24",
            "mcontent": "我记得isp会做源地址校验吧，只是伪造了源地址的包都发不到Internet上"
        },
        {
            "mid": "41525142",
            "mtime": "2024-05-26 10:44",
            "mcontent": "isp理论上可以，但我还没遇到过实际上这么做的。"
        },
        {
            "mid": "42252406",
            "mtime": "2024-05-26 12:25",
            "mcontent": "太天真了。ddos会让你drop都drop麻。所以ddos往往是多级网关drop。这一级到阈值了，直接放过到下一级判别处理。单机本身的处理能力有上限的。"
        },
        {
            "mid": "576146",
            "mtime": "2024-05-26 17:59",
            "mcontent": "ddos这个，我之前被攻击过，这个看你实际情况了如果是小流量的攻击，几百兆那种的，可以找个软件做下防护。你自己也可以试着写一下，针对网站的攻击不是单纯的发大量访问请求，而是半连接攻击，也就是tcp第一次握手请求后就不发了，这样大量请求等待对方第二次握手，没超时之前都堵在那，造成大量的拥堵，正常连接就进不来了。所以许多攻击都是假ip，或者一大堆肉鸡发的如果软件不行，就得考虑硬件，只是你要看下自己服务器的带宽是多少，比如带宽100兆，对方一下发来1g的流量，你的带宽就被堵死了，再好的硬件也没用所以，根据你被攻击的流量和带宽来用相应的解决方案大于自己流量的攻击，直接买云服务，在你域名解析到ip之前接一个清洗的服务，帮你过滤恶意请求"
        },
        {
            "mid": "42291495",
            "mtime": "2024-06-08 05:02",
            "mcontent": "这个我熟先说针对TCP的  syn flood. ack flood. 还有一些奇奇怪怪的标志位的flood    syn flood 一般防火墙的算法就是触发之后反向探测是不是真实源 算法根据防火墙是串联双向代理连接还是旁挂来选择不同的算法  后来攻击的人就想出了 先让你探测 我正常tcp三次握手.. 然后疯狂发syn flood  然后防火墙上不得不对syn限速 超过阈值的拉黑ack flood  串联部署查会话表就可以   旁路限速或者主动丢包/reset等重传/重连就可以  syn+ack  由于一般服务器出去的时候 是不去开启防御的 开启了可能会出现一些奇奇怪怪的问题.  旁路部署 出去的流量也不会经过防火墙   可以选择反向探测和限速  这个漏了对服务器影响不是很大UDP.. 业界难题 特别是QUIC协议.. DNS这些都还好  过滤大包 查询限速 或者白名单针对http/https的防火墙的做法一般就是301一个js回去. 让浏览器解析 用户验证. 针对https加密流量 就得先解密 靠cpu来干这个事肯定不现实.. 硬件卡成本又高 效果也不咋样.  这部分就慢慢放到服务器上去做了.  比如OpenResty自己开发 通过请求限速 人机挑战 等等来防cc攻击 要做到只拦截请求 不拉黑IP 单机百万并发  tls 4-5W新建还是要点东西的  在配合DNS负载均衡和3-4层负载均衡  集群达到千万上亿也不是不可能真实肉鸡针对80/443端口发送垃圾数据的攻击 可以做协议报文的校验.. 就是https的校验有点麻烦 要解密 好在tls有特征. 可以一次解密 多次拦截.api  api过不了人机验证这些东西.. 只能通过鉴权或者客户端和服务端协同 websocket 也和api差不多的逻辑  靠硬件防火墙很难做.再来说其他TCP应用一般是防火墙做一些连接限速和特征过滤  也可以根据业务上下文逻辑做拦截  比如游戏 一般都是先登录才有后面的操作    前些年传奇sf比较火的时候  防火墙厂商根据解析协议.. 可以在报文里面加一段数据发送到客户端... 然后就有了聊天窗口让你输入1+1=几..? 答错了 踢下线市面上的游戏盾也是通过hook socket 通过隧道传输到中转节点再到安全网关  隧道通过加密的方式防cc  还可以做到连接修复 通过sdk的api获取地址的时候会获取到多个中转节点 可以主备 或者 多路传输 在安全网关上去重组报文 在发送到服务端  中转节点可以用很便宜的云服务器. 搞个几十台  挂一个IP 不影响连接 需要安装插件或者特定的api去获取客户端真实IP. 这种就是依赖性太强. 对sdk本身的兼容性也有要求.有些sdk有后门 搞不好就成了别人的肉鸡.  阿里后来不知道为什么也下架这个产品"
        }
    ]
}